[
  {
    "id": 1,
    "title": "Uge 34",
    "summary": "Portefølje og oplæsning på unity",
    "fullContent": "<p>Denne uge blev primært brugt på at sætte op porteføljen, finde et template at arbejde ud fra.</p><p>Fik også gennemgået tutorials og andet vedrørende unity, så jeg er bedre forberedt til starten af spiludviklingen.</p><b>Opsummering/TL:DR</b><ul><li>Fik opsat portefølje</li><li>Tilføjede skills section til porteføljen</li><li>Lavede tutorials til unity</li> </ul>"
  },
  {
    "id": 2,
    "title": "Uge 35",
    "summary": "Blog indlæg og JavaScript",
    "fullContent": "<p>Uge 35 er blevet brugt på at få sat dettte blog indlægssystem op at køre. Planen er også at sætte mig ind i hvordan jeg kan overføre unity til en mobil app.</p><ul><li>Tilføjede blog system til portefølje</li></ul>"
  },
  {
    "id": 3,
    "title": "Uge 36",
    "summary": "Start af projekt",
    "fullContent": "<p>Vi brugte meget tid på at researche unity og hvilke tutorials der kunne være relevant til projektet</p><p>Men starten af projektet blev påbegyndt.</p><ul><li>Fik startet på mappet</li><li>Undersøgte tilemaps til projektet.</li></ul>"
  },
  {
    "id": 4,
    "title": "Uge 37",
    "summary": "Assets og første map",
    "fullContent": "<p>Denne uge var fokuseret på at jeg skulle lave et test map, ved at bruge de tilemaps som jeg researchede den forrige uge.</p><p>Fandt også nogle gratis assets vi kunne bruge til projektet, men vi mangler flere.</p><p>Jeg er også langsomt startet op på at undersøge hvordan vi kunne lave procedurally generated maps</p><p>Det ville være meget mere optimalt ift mit tidsforbrug.</p><ul><li>Første test map lavet, som forsøgsbane</li><li>Fandt assets til projekt</li><li>Research på procedurally generated maps.</li></ul>"
  },
  {
    "id": 5,
    "title": "Uge 38",
    "summary": "Procedural Generation",
    "fullContent": "<p>Er lige så stille begyndt at undersøge hvilke måder der ville være bedst at indføre procedural map generation til spillet. Jeg er startet på map generation ved hjælp af en tutorial, da det er et meget kompleks emne.</p>"
  },

  {
    "id": 6,
    "title": "Uge 39",
    "summary": "Unity Projekt",
    "fullContent": "<p>Så nogle online give et tip om at det ville være en god ide at prøve at genskabe simple populære spil, uden at følge en tutorial eller lignende for bedre lære unity. Jeg valgte at lave Flappy bird, da det var et af de forslag som foreslog.</p><p>Fik lavet en simpel kopi af flappy bird, med score, restart, væggene som bevæger sig og muligheden for at kunne dø i spillet. </p><p>Lærte mega meget af dette projekt, da jeg ikke følte jeg havde lavet nok i unity udover nogle små emner på hovedprojektet.</p>"
  },
  {
    "id": 7,
    "title": "Uge 41",
    "summary": "Praktik",
    "fullContent": "<p>Der skete ikke så meget ift. Projektet denne uge, da jeg havde travlt med at finde en praktikplads og skulle til samtaler.</p>"
  },
  {
    "id": 8,
    "title": "Uge 42",
    "summary": "RestAPI og SQL",
    "fullContent": "<p>Fik påbegyndt API delen, vedrørende mit andet guild.</p><p>Følte lidt at jeg havde glemt nogle af de ting som jeg havde lært i undervisningen i relation til API. Så jeg valgte at give mig selv en refresher og lavede et basisk test projekt.</p><p>Projektet bestod bare af en simpel version af en bank app som havde bruger registrering, som også havde nogle ‘penge’. Opsatte bare en simpel RestAPI som brugte en lokal SQL server.</p>"
  },
  {
    "id": 9,
    "title": "Uge 43",
    "summary": "API research",
    "fullContent": "<p>Ugen blev primært brugt på at se videoer og tage noter til API, de forskellige former for API man kunne benytte sig af.</p><p>Prøvede også at finde på nogle måder vi kunne inkludere API i projektet, på en sjov måde.</p><p>Har også læst lidt op på noget teori til spiludvilings guildet, da det var lidt manglende. Tænker næste uge skal bruges på at skrive teori og dokumentation til projektet.</p>"
  }
  
]